Revit 2027 API
DirectContext3DDocumentUtils.IsADirectContext3DHandleCategory Method
 Checks whether the provided category ID is one of the categories used by DirectContext3D handle elements.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsADirectContext3DHandleCategory(
	ElementId categoryId
)
Public Shared Function IsADirectContext3DHandleCategory (
	categoryId As ElementId
) As Boolean
public:
static bool IsADirectContext3DHandleCategory(
	ElementId^ categoryId
)
static member IsADirectContext3DHandleCategory :
        categoryId : ElementId -> bool
Parameters
categoryId ElementId
 The category ID to check.
Return Value
Boolean
 True, if the category is valid for DirectContext3D handle elements, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DirectContext3DDocumentUtils Class
Autodesk.Revit.DB.DirectContext3D Namespace